###################################################################

# Created by write_sdc on Tue Dec 25 00:11:12 2018

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -power mW -voltage V       \
-current mA
set_operating_conditions slow -library slow
# set_wire_load_model -name tsmc13_wl10 -library slow
set_load -pin_load 1 [get_ports {rom_a[6]}]
set_load -pin_load 1 [get_ports {rom_a[5]}]
set_load -pin_load 1 [get_ports {rom_a[4]}]
set_load -pin_load 1 [get_ports {rom_a[3]}]
set_load -pin_load 1 [get_ports {rom_a[2]}]
set_load -pin_load 1 [get_ports {rom_a[1]}]
set_load -pin_load 1 [get_ports {rom_a[0]}]
set_load -pin_load 1 [get_ports {sram_a[9]}]
set_load -pin_load 1 [get_ports {sram_a[8]}]
set_load -pin_load 1 [get_ports {sram_a[7]}]
set_load -pin_load 1 [get_ports {sram_a[6]}]
set_load -pin_load 1 [get_ports {sram_a[5]}]
set_load -pin_load 1 [get_ports {sram_a[4]}]
set_load -pin_load 1 [get_ports {sram_a[3]}]
set_load -pin_load 1 [get_ports {sram_a[2]}]
set_load -pin_load 1 [get_ports {sram_a[1]}]
set_load -pin_load 1 [get_ports {sram_a[0]}]
set_load -pin_load 1 [get_ports {sram_d[7]}]
set_load -pin_load 1 [get_ports {sram_d[6]}]
set_load -pin_load 1 [get_ports {sram_d[5]}]
set_load -pin_load 1 [get_ports {sram_d[4]}]
set_load -pin_load 1 [get_ports {sram_d[3]}]
set_load -pin_load 1 [get_ports {sram_d[2]}]
set_load -pin_load 1 [get_ports {sram_d[1]}]
set_load -pin_load 1 [get_ports {sram_d[0]}]
set_load -pin_load 1 [get_ports sram_wen]
set_load -pin_load 1 [get_ports finish]
set_max_fanout 6 [get_ports clk]
set_max_fanout 6 [get_ports reset]
set_max_fanout 6 [get_ports {rom_q[7]}]
set_max_fanout 6 [get_ports {rom_q[6]}]
set_max_fanout 6 [get_ports {rom_q[5]}]
set_max_fanout 6 [get_ports {rom_q[4]}]
set_max_fanout 6 [get_ports {rom_q[3]}]
set_max_fanout 6 [get_ports {rom_q[2]}]
set_max_fanout 6 [get_ports {rom_q[1]}]
set_max_fanout 6 [get_ports {rom_q[0]}]
set_max_fanout 6 [get_ports {sram_q[7]}]
set_max_fanout 6 [get_ports {sram_q[6]}]
set_max_fanout 6 [get_ports {sram_q[5]}]
set_max_fanout 6 [get_ports {sram_q[4]}]
set_max_fanout 6 [get_ports {sram_q[3]}]
set_max_fanout 6 [get_ports {sram_q[2]}]
set_max_fanout 6 [get_ports {sram_q[1]}]
set_max_fanout 6 [get_ports {sram_q[0]}]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_latency 0.5  [get_clocks clk]
set_clock_uncertainty 0.1  [get_clocks clk]
set_input_delay -clock clk  1  [get_ports reset]
set_input_delay -clock clk  1  [get_ports {rom_q[7]}]
set_input_delay -clock clk  1  [get_ports {rom_q[6]}]
set_input_delay -clock clk  1  [get_ports {rom_q[5]}]
set_input_delay -clock clk  1  [get_ports {rom_q[4]}]
set_input_delay -clock clk  1  [get_ports {rom_q[3]}]
set_input_delay -clock clk  1  [get_ports {rom_q[2]}]
set_input_delay -clock clk  1  [get_ports {rom_q[1]}]
set_input_delay -clock clk  1  [get_ports {rom_q[0]}]
set_input_delay -clock clk  1  [get_ports {sram_q[7]}]
set_input_delay -clock clk  1  [get_ports {sram_q[6]}]
set_input_delay -clock clk  1  [get_ports {sram_q[5]}]
set_input_delay -clock clk  1  [get_ports {sram_q[4]}]
set_input_delay -clock clk  1  [get_ports {sram_q[3]}]
set_input_delay -clock clk  1  [get_ports {sram_q[2]}]
set_input_delay -clock clk  1  [get_ports {sram_q[1]}]
set_input_delay -clock clk  1  [get_ports {sram_q[0]}]
set_output_delay -clock clk  1  [get_ports {rom_a[6]}]
set_output_delay -clock clk  1  [get_ports {rom_a[5]}]
set_output_delay -clock clk  1  [get_ports {rom_a[4]}]
set_output_delay -clock clk  1  [get_ports {rom_a[3]}]
set_output_delay -clock clk  1  [get_ports {rom_a[2]}]
set_output_delay -clock clk  1  [get_ports {rom_a[1]}]
set_output_delay -clock clk  1  [get_ports {rom_a[0]}]
set_output_delay -clock clk  1  [get_ports {sram_a[9]}]
set_output_delay -clock clk  1  [get_ports {sram_a[8]}]
set_output_delay -clock clk  1  [get_ports {sram_a[7]}]
set_output_delay -clock clk  1  [get_ports {sram_a[6]}]
set_output_delay -clock clk  1  [get_ports {sram_a[5]}]
set_output_delay -clock clk  1  [get_ports {sram_a[4]}]
set_output_delay -clock clk  1  [get_ports {sram_a[3]}]
set_output_delay -clock clk  1  [get_ports {sram_a[2]}]
set_output_delay -clock clk  1  [get_ports {sram_a[1]}]
set_output_delay -clock clk  1  [get_ports {sram_a[0]}]
set_output_delay -clock clk  1  [get_ports {sram_d[7]}]
set_output_delay -clock clk  1  [get_ports {sram_d[6]}]
set_output_delay -clock clk  1  [get_ports {sram_d[5]}]
set_output_delay -clock clk  1  [get_ports {sram_d[4]}]
set_output_delay -clock clk  1  [get_ports {sram_d[3]}]
set_output_delay -clock clk  1  [get_ports {sram_d[2]}]
set_output_delay -clock clk  1  [get_ports {sram_d[1]}]
set_output_delay -clock clk  1  [get_ports {sram_d[0]}]
set_output_delay -clock clk  1  [get_ports sram_wen]
set_output_delay -clock clk  1  [get_ports finish]
set_drive 1  [get_ports clk]
set_drive 1  [get_ports reset]
set_drive 1  [get_ports {rom_q[7]}]
set_drive 1  [get_ports {rom_q[6]}]
set_drive 1  [get_ports {rom_q[5]}]
set_drive 1  [get_ports {rom_q[4]}]
set_drive 1  [get_ports {rom_q[3]}]
set_drive 1  [get_ports {rom_q[2]}]
set_drive 1  [get_ports {rom_q[1]}]
set_drive 1  [get_ports {rom_q[0]}]
set_drive 1  [get_ports {sram_q[7]}]
set_drive 1  [get_ports {sram_q[6]}]
set_drive 1  [get_ports {sram_q[5]}]
set_drive 1  [get_ports {sram_q[4]}]
set_drive 1  [get_ports {sram_q[3]}]
set_drive 1  [get_ports {sram_q[2]}]
set_drive 1  [get_ports {sram_q[1]}]
set_drive 1  [get_ports {sram_q[0]}]
